requests/SessionCreateRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext"
                  xmlns:mes="http://www.ebxml.org/namespaces/messageHeader"
                  xmlns:ns="http://www.opentravel.org/OTA/2002/11">
<soapenv:Header>
  <sec:Security>
    <sec:UsernameToken>
      <sec:Username>{userName}</sec:Username>
      <sec:Password>{password}</sec:Password>
      <Organization>{organization}</Organization>
      <Domain>{domain}</Domain>
    </sec:UsernameToken>
  </sec:Security>
  <mes:MessageHeader mes:id="?" mes:version="1.0.00">
    <mes:From>
      <mes:PartyId mes:type="urn:x12.org:IO5:01">1000</mes:PartyId>
    </mes:From>
    <mes:To>
      <mes:PartyId mes:type="urn:x12.org:IO5:01">1000</mes:PartyId>
    </mes:To>
    <mes:CPAId>{organization}</mes:CPAId>
    <mes:ConversationId>{conversationId}</mes:ConversationId>
    <mes:Service mes:type="OTA">SessionCreateRQ</mes:Service>
    <mes:Action>SessionCreateRQ</mes:Action>
    <mes:MessageData>
      <mes:MessageId>{messageId}</mes:MessageId>
      <mes:Timestamp>{timestamp}</mes:Timestamp>
    </mes:MessageData>
  </mes:MessageHeader>
</soapenv:Header>
<soapenv:Body>
  <ns:SessionCreateRQ returnContextID="?">
    <ns:POS>
      <ns:Source PseudoCityCode="?" />
    </ns:POS>
  </ns:SessionCreateRQ>
</soapenv:Body>
</soapenv:Envelope>
